feat: updating the overriding readme file and restore the abstration readme
